# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\quint\Downloads\Ultrasonic Ranger.cydsn\Ultrasonic Ranger.cydsn\Ultrasonic Ranger.cyprj
# Date: Tue, 26 Nov 2019 20:18:22 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 750 -waveform {0 375} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_1(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 19} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 25} [list]


# Component constraints for C:\Users\quint\Downloads\Ultrasonic Ranger.cydsn\Ultrasonic Ranger.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\quint\Downloads\Ultrasonic Ranger.cydsn\Ultrasonic Ranger.cydsn\Ultrasonic Ranger.cyprj
# Date: Tue, 26 Nov 2019 20:18:20 GMT
